;;Localization data taken from Long War 2 by Pavonis Interactive;;
;;;;;;;;;;;;;;;;;;;;  ITEM TEMPLATES ;;;;;;;;;;;;;;;;;;;;;;;

[Pistol_CG X2WeaponTemplate]
FriendlyName="高斯手枪"
FriendlyNamePlural="高斯手枪"
BriefSummary="一种威力强大的副武器，可以穿透敌人的护甲。"
TacticalText="<Bullet/>线圈武器会穿透1点敌方护甲。\n<Bullet/>手枪射击只需要一个行动点。\n<Bullet/>士兵们可以通过训练特定的技能来大幅度增加手枪的威力。\n<Bullet/>在远距离射击时手枪的命中率会降低。"
AbilityDescName="手枪"

[AssaultRifle_CG X2WeaponTemplate]
FriendlyName="线圈步枪"
FriendlyNamePlural="线圈步枪"
BriefSummary="一种强大的、中距离护甲穿透线圈枪，担任突击步枪的角色。"
TacticalText="<Bullet/> 线圈武器自动穿透（无视）1点敌人护甲。<br/><Bullet/> 缺乏特殊训练的情况下，用主武器射击将会结束该士兵的回合。\n<Bullet/>使用从变种人敌人身上取得的升级部件提升线圈步枪的战术效率。<br/>"
AbilityDescName="突击步枪"

[Cannon_CG X2WeaponTemplate]
FriendlyName="高斯加农炮"
FriendlyNamePlural="高斯加农炮"
BriefSummary="一种重型的自动化线圈枪，射速很快。"
TacticalText="<Bullet/> 线圈武器自动穿透（无视）1点敌人护甲。<br/><Bullet/> 加农炮担任的是小队自动化武器的职责，拥有更多的弹药，比步枪能造成更多伤害，但是比较笨重。<br/><Bullet/> 使用从变种人敌人那收集的升级提升高斯加农炮的战术效率。<br/>"
AbilityDescName="加农炮"

[SniperRifle_CG X2WeaponTemplate]
FriendlyName="高斯长枪"
FriendlyNamePlural="高斯长枪"
BriefSummary="加长版的线圈步枪，可由神枪手使用。"
TacticalText="<Bullet/>线圈武器会穿透（无视）1点敌方护甲。<br/><Bullet/>如果没有经过特殊训练，狙击步枪一般需要2个行动点来射击。\n<Bullet/>它们在近距离精确度不高，但是在远距离具有致命的杀伤力。\n<Bullet/>使用从变种人敌人那收集的升级来提升高斯长枪的战术效果。"
AbilityDescName="狙击步枪"

[Shotgun_CG X2WeaponTemplate]
FriendlyName="散射枪"
FriendlyNamePlural="散射枪"
BriefSummary="一种可以代替霰弹枪的近距离线圈武器。"
TacticalText="<Bullet/>线圈武器会穿透（无视）1点敌方护甲。<br/><Bullet/>霰弹型武器在近距离极为有效，但是它们的命中率在远距离下降得很快。\n<Bullet/>使用从敌人身上取得的升级部件提升散射枪的战术效率。"
AbilityDescName="霰弹枪"

[SMG_CG X2WeaponTemplate]
FriendlyName="小线圈"
FriendlyNamePlural="小线圈"
BriefSummary="一种轻量型的线圈步枪，威力相对变小但是能提高使用者在战场上的移动力。"
TacticalText="<Bullet/>线圈武器会穿透（无视）1点敌方护甲。<br/><Bullet/>冲锋枪风格的武器相比突击步枪能提供额外的移动力，近战精度和隐蔽性，但他们伤害更低，弹匣更小，并在远距离受到精度减益。<br/>"
AbilityDescName="冲锋枪"

[AssaultRifle_LS X2WeaponTemplate]
FriendlyName="脉冲步枪"
FriendlyNamePlural="脉冲步枪"
BriefSummary="脉冲步枪发射出一系列微秒级别的光波，能够破坏目标的化学键。"
TacticalText="<Bullet/>若没有经过特殊训练，用主武器射击将会结束该士兵的回合。\n<Bullet/>使用从变种人敌人身上取得的升级部件提升脉冲步枪的战术效率。\n<Bullet/>该激光武器的高能输出是将外星技术集成到战前激光武器而得来的。"
AbilityDescName="突击步枪"

[SMG_LS X2WeaponTemplate]
FriendlyName="脉冲斯登枪"
FriendlyNamePlural="脉冲斯登枪"
BriefSummary="脉冲步枪的轻便版本，担任与冲锋枪类似的角色，以威力，弹药和远距离精度为代价，为士兵提供更高的移动力和隐蔽性。"
TacticalText="<Bullet/>若没有经过特殊训练，用主武器射击将会结束该士兵的回合。\n<Bullet/>使用从变种人敌人身上取得的升级部件提升轻机枪的战术效率。\n<Bullet/>冲锋枪类型的武器相比突击步枪提供额外的移动力，近程精度以及隐蔽性，但它们的伤害更低，弹药更少，并且在远距离有精度减益。"
AbilityDescName="冲锋枪"

[Cannon_LS X2WeaponTemplate]
FriendlyName="脉冲加农炮"
FriendlyNamePlural="脉冲加农炮"
BriefSummary="脉冲武器技术中包含了一项改进的冷却系统，能让我们部署一种能连发射击的加农炮，能够倾泻更加致命的火力。"
TacticalText="<Bullet/>脉冲加农炮是一种威力巨大版的磁力加农炮，且同样易于部署。\n<Bullet/>使用从敌人身上收集的升级部件提升脉冲加农炮的战术效率。"
AbilityDescName="加农炮"

[Shotgun_LS X2WeaponTemplate]
FriendlyName="散射爆裂枪"
FriendlyNamePlural="散射爆裂枪"
BriefSummary="散射爆裂枪是一种脉冲激光技术的应用，以提供类似霰弹枪的效果；由于光漫射，它在近距离威力最为巨大。"
TacticalText="<Bullet/>霰弹型武器在近距离极为有效，但是它们的命中率在远距离下降得很快。\n<Bullet/>使用从敌人身上取得的升级部件提升散射爆裂枪的战术效率。"
AbilityDescName="霰弹枪"

[SniperRifle_LS X2WeaponTemplate]
FriendlyName="脉冲长枪"
FriendlyNamePlural="脉冲长枪"
BriefSummary="作为脉冲步枪的远距离步枪版本，脉冲长枪集成了极度高能的闪光电容，结果成就了此高精度远距离的激光武器。"
TacticalText="<Bullet/>狙击步枪总是需要2个行动点来射击。\n<Bullet/>它们在近距离精确度不高，但是在远距离具有致命的杀伤能力。\n<Bullet/>使用从敌人身上取得的升级部件提升脉冲长枪的战术效率。"
AbilityDescName="狙击步枪"

[Pistol_LS X2WeaponTemplate]
FriendlyName="脉冲手枪"
FriendlyNamePlural="脉冲手枪"
BriefSummary="一种简单的脉冲发射器，能够用作副武器。"
TacticalText="<Bullet/>脉冲手枪相比磁力手枪更有效率。\n<Bullet/>手枪开火需要1个行动点。"
AbilityDescName="手枪"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; Techs ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[CoilGunTech_LW X2TechTemplate]
DisplayName="线圈枪"
CodeName="拉斯"
Summary="现在是从反向工程缴获的武器更进一步，到开发比变种人的武器更为先进的磁力武器的时候了。"
LongDescription="线圈磁力武器的概念已经提出很久了，但是它一直都需要我们对外星材料和能量供应的理解才能使其成为现实。而如今的现实是我们开发的武器已经超越了变种人部队的火力，已经达到了某些外星人武器的程度了。我们的线圈枪子弹包裹有额外塑料的护套，会在子弹在枪管内运动时融化，子弹的速度甚至要比那些外星人的电磁枪系统还要快。子弹本身也能穿透薄的护甲。R·泰根。"

[AdvancedCoilGunTech_LW X2TechTemplate]
DisplayName="高级线圈枪"
CodeName="火狐"
Summary="我们现在能够把注意转移到开发特殊线圈武器上了。"
LongDescription="调整我们全新的线圈枪以适用于我们现有的战斗角色的挑战十分困难；线圈本身必须精确地调整，这样子弹就不会在枪管中错位导致非常严重的后果。这也许也解释了变种人从未使用此类武器的原因；制造它们需要的财力和劳力太高了，并不适用于给全世界的克隆人军队大规模生产。不过，它们依然是一小撮专家级士兵的完美配搭。R·泰根。"

[LaserWeaponsTech_LW X2TechTemplate]
DisplayName="脉冲激光武器"
Summary="利用我们对于磁力学和外星超铀的全新理解，我们应当能够开发一种强力的激光武器。"
CodeName="中后卫"
LongDescription="通过研究外星人在武器上管理能量消耗和散热的技术，我们成功完成了一种工程原型机，我们将其称之为脉冲激光武器，虽然一些士兵更喜欢叫它们「爆破手」，原因我不太清楚。这些武器能够输出的能量令人叹为观止，但其系统无法维持如此大量的光束输出，因此它的架构依靠一系列的皮秒级的，高能量密度的脉冲去打破光束击中目标的化学键。平均计算，这些武器应当能够比我们之前开发的磁力武器造成更大的伤害，虽然它们还比不上那些外星人使用的电浆光束设备。理查德·泰根。"

[AdvancedLaserWeaponsTech_LW X2TechTemplate]
DisplayName="高级脉冲激光"
Summary="随着对脉冲激光技术基础的完全理解，我们相信现在能够为军队开发一些专用脉冲激光武器。"
CodeName="支点"
LongDescription="感谢军队和工程团队的反馈，我们现在对脉冲武器技术有了更全面的理解，因此现在我们能够进一步在光学，脉冲频率，电容器方面对脉冲武器设计进行改进，以此开发出一系列能运用在不同战场上的武器。理查德·泰根。"
